test-combo-1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ProvideQuotation xmlns="WS-IntegratedQuote">
      <userID>4072</userID>
      <userCode>111427</userCode>
      <quoteDetails>
        <ResidenceID>1</ResidenceID>
        <TypePolicyID>1</TypePolicyID>
        <TypePackageID>1</TypePackageID>
        <Destination>Europe</Destination>
        <StartDate>2025/10/15</StartDate>
        <EndDate>2025/10/22</EndDate>
        <Travellers>
          <Traveller>
            <TravellerNumber>1</TravellerNumber>
            <Title>Mr</Title>
            <FirstName>John</FirstName>
            <LastName>Doe</LastName>
            <DateOfBirth>1990/01/01</DateOfBirth>
            <Age>35</Age>
            <AgebandID>3</AgebandID>
            <TitleID>1</TitleID>
            <minAge>35</minAge>
            <maxAge>35</maxAge>
            <ScreeningInformation xsi:nil="true" />
          </Traveller>
        </Travellers>
        <ContactDetails>
          <Address>123 Main Street</Address>
          <Postcode>12345</Postcode>
          <Email>test@example.com</Email>
          <Telephone>+30123456789</Telephone>
        </ContactDetails>
        <includeAnnualQuotes>1</includeAnnualQuotes>
        <includeUpsell>1</includeUpsell>
        <currencyID>1</currencyID>
        <groupPerProduct>false</groupPerProduct>
        <priceOrder>1</priceOrder>
        <useCoverLevelUpsell>true</useCoverLevelUpsell>
        <quoteVisitAuditID>1703123456789</quoteVisitAuditID>
      </quoteDetails>
    </ProvideQuotation>
  </soap:Body>
</soap:Envelope>












